; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	infrared3 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	thermograph8 - mode
	spectrograph1 - mode
	image6 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	thermograph7 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 spectrograph5)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph8)
	(supports instrument3 image6)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph7)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph4)
	(supports instrument5 thermograph7)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon5 spectrograph4)
	(have_image Phenomenon5 thermograph7)
	(have_image Phenomenon5 spectrograph1)
	(have_image Planet6 spectrograph2)
	(have_image Planet6 spectrograph4)
	(have_image Planet6 spectrograph0)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 spectrograph2)
	(have_image Planet9 thermograph7)
	(have_image Phenomenon10 spectrograph2)
))

)

; plan
1. (turn_to satellite3 star4 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star4)
   goals met: 0 of 13
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 13
3. (calibrate satellite3 instrument6 star4)
   added: (calibrated instrument6)
   goals met: 0 of 13
4. (turn_to satellite3 phenomenon5 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 phenomenon5)
   goals met: 0 of 13
5. (turn_to satellite2 groundstation3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 13
6. (turn_to satellite1 star0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star0)
   goals met: 0 of 13
7. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 13
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
9. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 13
10. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 13
11. (take_image satellite3 phenomenon5 instrument6 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 1 of 13
12. (turn_to satellite1 planet6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet6)
   goals met: 1 of 13
13. (take_image satellite1 planet6 instrument3 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 2 of 13
14. (turn_to satellite1 phenomenon8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 13
15. (take_image satellite1 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 13
16. (take_image satellite1 phenomenon8 instrument3 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 5 of 13
17. (turn_to satellite2 phenomenon10 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon10)
   goals met: 5 of 13
18. (take_image satellite2 phenomenon10 instrument5 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 6 of 13
19. (turn_to satellite2 phenomenon5 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon5)
   goals met: 6 of 13
20. (take_image satellite2 phenomenon5 instrument5 spectrograph4)
   added: (have_image phenomenon5 spectrograph4)
   goals met: 7 of 13
21. (take_image satellite2 phenomenon5 instrument5 thermograph7)
   added: (have_image phenomenon5 thermograph7)
   goals met: 8 of 13
22. (turn_to satellite2 planet6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet6)
   goals met: 8 of 13
23. (take_image satellite2 planet6 instrument5 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 9 of 13
24. (take_image satellite2 planet6 instrument5 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 10 of 13
25. (turn_to satellite2 planet9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet9)
   goals met: 10 of 13
26. (take_image satellite2 planet9 instrument5 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 11 of 13
27. (take_image satellite2 planet9 instrument5 thermograph7)
   added: (have_image planet9 thermograph7)
   goals met: 12 of 13
28. (turn_to satellite3 star7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star7)
   goals met: 12 of 13
29. (take_image satellite3 star7 instrument6 infrared3)
   added: (have_image star7 infrared3)
   goals met: 13 of 13
